FGSFoam/03_testcase/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    p
    {
	solver		PCG;
        preconditioner
        {
	    preconditioner GAMG;
            tolerance        2e-5;
            relTol           0.05;
            nVcycles         2;
            smoother         GaussSeidel;
        }
        nPreSweeps       0;
        nPostSweeps      2;
        nFinestSweeps    2;

        cacheAgglomeration false;
        nCellsInCoarsestLevel 300;
        agglomerator     faceAreaPair;
        mergeLevels      1;
        
        tolerance        1e-6;
        relTol           0.05;
        maxIter          100;
    }

    pFinal
    {
	solver		PCG;
        preconditioner
        {
	    preconditioner	GAMG;
	    tolerance        2e-5;
            relTol           0.05;
            nVcycles         2;
            smoother         GaussSeidel;
        }
            
	nPreSweeps       0;
	nPostSweeps      2;
	nFinestSweeps    2;
	cacheAgglomeration false;
	nCellsInCoarsestLevel 300;
	agglomerator     faceAreaPair;
	mergeLevels      1;
    
        tolerance        1e-6;
        relTol           0;
        maxIter          100;
    }

    "(U|h|Z|PV|k|epsilon|omega)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.01;
    }

    "(U|h|Z|PV|k|epsilon|omega|varZ|varPV)Final"
    {
        $U;
        relTol          0;
    }

    Yi
    {
        $hFinal;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors  1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;
}


// ************************************************************************* //
